{
    "alpha-nvim": {
        "branch": "main"
    },
    "catppuccin": {
        "branch": "main"
    },
    "indent-blankline.nvim": {
        "branch": "master"
    },
    "lazy.nvim": {
        "branch": "main"
    },
    "lualine.nvim": {
        "branch": "master"
    },
    "neoscroll.nvim": {
        "branch": "master"
    },
    "nvim-surround": {
        "branch": "main"
    },
    "nvim-tree.lua": {
        "branch": "master"
    },
    "nvim-treesitter": {
        "branch": "main"
    },
    "nvim-treesitter-context": {
        "branch": "master"
    },
    "nvim-treesitter-textobjects": {
        "branch": "main"
    },
    "nvim-web-devicons": {
        "branch": "master"
    },
    "plenary.nvim": {
        "branch": "master"
    },
    "telescope-fzf-native.nvim": {
        "branch": "main"
    },
    "telescope.nvim": {
        "branch": "master"
    },
    "treesitter-modules.nvim": {
        "branch": "main"
    },
    "virt-column.nvim": {
        "branch": "master"
    },
    "which-key.nvim": {
        "branch": "main"
    }
}
