{
    "alpha-nvim": {
        "branch": "main"
    },
    "auto-session": {
        "branch": "main"
    },
    "blink.cmp": {
        "branch": "main"
    },
    "bufferline.nvim": {
        "branch": "main"
    },
    "catppuccin": {
        "branch": "main"
    },
    "colorful-menu.nvim": {
        "branch": "master"
    },
    "conform.nvim": {
        "branch": "master"
    },
    "fidget.nvim": {
        "branch": "main"
    },
    "friendly-snippets": {
        "branch": "main"
    },
    "gitsigns.nvim": {
        "branch": "main"
    },
    "indent-blankline.nvim": {
        "branch": "master"
    },
    "lazy.nvim": {
        "branch": "main"
    },
    "lazydev.nvim": {
        "branch": "main"
    },
    "lspkind.nvim": {
        "branch": "master"
    },
    "lualine.nvim": {
        "branch": "master"
    },
    "neoscroll.nvim": {
        "branch": "master"
    },
    "nvim-autopairs": {
        "branch": "master"
    },
    "nvim-colorizer.lua": {
        "branch": "master"
    },
    "nvim-lspconfig": {
        "branch": "master"
    },
    "nvim-surround": {
        "branch": "main"
    },
    "nvim-tree.lua": {
        "branch": "master"
    },
    "nvim-treesitter": {
        "branch": "main"
    },
    "nvim-treesitter-context": {
        "branch": "master"
    },
    "nvim-treesitter-textobjects": {
        "branch": "main"
    },
    "nvim-ufo": {
        "branch": "main"
    },
    "nvim-web-devicons": {
        "branch": "master"
    },
    "plenary.nvim": {
        "branch": "master"
    },
    "promise-async": {
        "branch": "main"
    },
    "render-markdown.nvim": {
        "branch": "main"
    },
    "statuscol.nvim": {
        "branch": "main"
    },
    "telescope-file-browser.nvim": {
        "branch": "master"
    },
    "telescope-fzf-native.nvim": {
        "branch": "main"
    },
    "telescope.nvim": {
        "branch": "master"
    },
    "todo-comments.nvim": {
        "branch": "main"
    },
    "treesitter-modules.nvim": {
        "branch": "main"
    },
    "ts-comments.nvim": {
        "branch": "main"
    },
    "vim-tmux-navigator": {
        "branch": "master"
    },
    "virt-column.nvim": {
        "branch": "master"
    },
    "which-key.nvim": {
        "branch": "main"
    }
}
