# Each section is arranged alphabetically.

# GNU utilities (replace macOS defaults - those that come with macOS are outdated or have weird behaviors).
# Add `$(brew --prefix <package_name>)/libexec/ghubin` to `$PATH`.
brew "coreutils"
brew "findutils"
brew "gnu-getopt"
brew "gnu-sed"

# System utility overrides.
brew "bash"
brew "curl"
brew "grep"
brew "less" # Updated version of less.
brew "screen"
brew "telnet"
brew "wget"
brew "zsh"

# Shell & terminal enhancements.
brew "fzf"
brew "starship" # Cross-shell prompt.
brew "tmux"
brew "zoxide" # Smart cd replacement.

# Version control & development tools.
brew "gh" # GitHub CLI
brew "git"
brew "git-delta" # Modern syntax-highlighting pager for git diffs.
brew "git-extras"
brew "lazygit" # Terminal UI for git commands.
brew "neovim"
brew "pre-commit"
brew "tree-sitter-cli" # For use with Neovim

# File & directory management.
brew "ack"
brew "eza" # Modern replacement for `ls` command.
brew "fd" # Faster alternative to `find` command.
brew "stow" # Symlink manager for dotfiles.
brew "tree"
brew "yazi" # Terminal file manager.

# Text processing & search.
brew "bat" # Alternative to `cat` command.
brew "highlight"
brew "jq" # JSON processor.
brew "ripgrep" # Fast text search tool.
brew "yq" # YAML processor.

# System monitoring & info.
brew "btop" # Alternative to `top` and `htop` commands.
brew "fastfetch" # Faster alternative to neofetch for system info.

# Network tools.
brew "iperf3" # Network performance measurement tool.

# Media processing.
brew "ffmpeg"
brew "imagemagick" # For conversion of images from one format to another.

# Package managers & utilities.
brew "mas" # Mac App Store CLI.
brew "uv" # Python package and project manager.

# Programming languages to be installed without version managers.
brew "lua" # For use with Neovim.

# Language version managers.
# We will use these to install the languages, rather than download the
# languages themselves.
brew "direnv"
brew "goenv"
brew "jenv"
brew "nodenv"
brew "pyenv"
brew "rbenv"

# Formatting, linting, code quality and analysis tools.
brew "biome"
brew "clang-format"
brew "goimports"
brew "google-java-format"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "yamlfmt"

# LSP (Language Server Protocol) servers.
brew "bash-language-server"
brew "basedpyright"
brew "gopls"
brew "helm-ls"
brew "jdtls"
brew "lua-language-server"
brew "marksman"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "yaml-language-server"

# Container, Kubernetes & cloud tools.
brew "ctop" # Like `top` command, but for Docker.
brew "dive" # Inspect Docker images in depth.
brew "helm"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "stern"

# AI & machine learning.
brew "ccusage" # Tool for checking Claude Code usage.
brew "gollama" # TUI for managing Ollama models.
brew "ollama"

# Security & privacy.
brew "bitwarden-cli" # For using Bitwarden with Raycast.

# Media & entertainment.
brew "yt-dlp"

# Miscellaneous.
brew "kcat" # Apache Kafka producer and consumer.

# Browsers.
cask "firefox"
cask "google-chrome"
cask "zen"

# Development tools.
cask "android-studio"
cask "docker-desktop"
cask "iterm2"
cask "mongodb-compass"
cask "postman"
cask "raycast" # Alternative to Spotlight and Alfred with focus on development features.
cask "redis-insight"
cask "visual-studio-code"

# AI applications.
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "lm-studio"
cask "msty"

# Productivity & utilities.
cask "itsycal" # Utility for displaying calendar events in the menu bar.
cask "karabiner-elements" # Utility for custom keymaps.
cask "keyboardcleantool" # Utility for locking keyboard input while cleaning.
cask "keyclu" # Show keyboard shortcuts for any app
cask "maccy" # Clipboard manager.
cask "rectangle" # Window Manager. Alternative to Spectacle as it is no longer maintained.

# System utilities.
cask "adguard"
cask "appcleaner"
cask "betterdisplay"
cask "cloudflare-warp" # Best general purpose VPN.
cask "daisydisk"
cask "imageoptim"
cask "istat-menus"
cask "macmediakeyforwarder"
cask "mhaeuser/mhaeuser/battery-toolkit" # Battery management tool.
cask "mos" # Mouse utility.
cask "neo-network-utility" # Network diagnostic tool.
cask "the-unarchiver"

# Entertainment & media.
cask "discord"
cask "downie"
cask "iina" # Much better native alternative to VLC.
cask "lastfm" # Music scrobbling service.
cask "qbittorrent" # Free and open-source BitTorrent client.
cask "spotify"
cask "whatsapp"
cask "xld" # Audio converter.

# Content & reading.
cask "netnewswire" # RSS reader.
cask "notion"

# Quick-look plugins.
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "syntax-highlight"
cask "suspicious-package"
cask "webpquicklook"

# Languages and SDKs.
cask "flutter"
cask "temurin@21"

# Fonts.
cask "font-cascadia-code-nf" # Default terminal font
cask "font-fira-code" # Backup programming/terminal font
cask "font-ibm-plex-mono" # Postman font
cask "font-ibm-plex-sans" # Better Sans font for applications that allow us to set it, e.g., Zen/Firefox
cask "font-meslo-lg-nerd-font" # Default non-ASCII terminal font
cask "font-monaspace" # Default programming font
cask "font-source-serif-4" # Better Serif font for applications that allow us to set it, e.g., Zen/Firefox
