# Taps.
tap "caskroom/cask"
tap "caskroom/versions"
tap "caskroom/fonts"
tap "homebrew/cask-drivers"

# Install GNU core utilities (those that come with macOS are outdated).
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"

# Install GNU `sed`, overwriting the built-in `sed`.
brew "gnu-sed", args: ["with-default-names"]

# Plugins for ZSH.
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# Utilities.
brew "wget"
brew "tmux"
brew "vim", args: ["with-overrride-system-vi"]
brew "neovim"
brew "grep", args: ["with-default-names"]
brew "screen"
brew "highlight"
brew "ranger"

# Faster and easier finding.
brew "fd" # Faster alternative to `find` command.
brew "the_silver_searcher" # Provides the `ag` command.

# Programming related packages.
brew "clang-format"
brew "cmake"
brew "google-java-format"
brew "lua"
brew "mongodb"
brew "perl"
brew "postgresql"
brew "python"
brew "redis"
brew "ruby"
brew "shfmt"
brew "sqlite"

# Install other useful binaries.
brew "ack"
brew "git"
brew "tree"

# Fun packages.
brew "lolcat"

# GUI applications.
cask "android-file-transfer"
cask "appcleaner"
cask "dashlane"
cask "dropbox"
cask "firefox"
cask "firefox-developer-edition"
cask "gitter"
cask "google-chrome"
cask "komanda"
cask "logitech-options"
cask "microsoft-office"
cask "opera"
cask "slack"
cask "spectacle"
cask "spotify"
cask "the-unarchiver"
cask "vlc"
cask "webtorrent"
cask "whatsapp"

# Quick-look plugins.
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "quicklook-csv"

# Development utilities.
cask "dash"
cask "docker"
cask "github"
cask "hyper"
cask "insomnia"
cask "intellij-idea"
cask "iterm2"
cask "java8"
cask "love"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"

# Fonts.
cask "font-hack-nerd-font"
